Framebuffer plans update
